espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_prcm.h
// Field:   [3:0] CLK_EN
//
// Each bit below has the following meaning:
//
// 0: Disable clock
// 1: Enable clock
//
// Can be forced on by AM_CLK_EN
//
// ENUMs can be combined
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
// ENUMs:
// GPT3                     Enable clock for GPT3
// GPT2                     Enable clock for GPT2
// GPT1                     Enable clock for GPT1
// GPT0                     Enable clock for GPT0
#define PRCM_GPTCLKGR_CLK_EN_W                                               4
#define PRCM_GPTCLKGR_CLK_EN_M                                      0x0000000F
#define PRCM_GPTCLKGR_CLK_EN_S                                               0
#define PRCM_GPTCLKGR_CLK_EN_GPT3                                   0x00000008
#define PRCM_GPTCLKGR_CLK_EN_GPT2                                   0x00000004
#define PRCM_GPTCLKGR_CLK_EN_GPT1                                   0x00000002
#define PRCM_GPTCLKGR_CLK_EN_GPT0                                   0x00000001

//*****************************************************************************
//
// Register: PRCM_O_GPTCLKGS
//
//*****************************************************************************
// Field:   [3:0] CLK_EN
//
// Each bit below has the following meaning:
//
// 0: Disable clock
// 1: Enable clock
//
// Can be forced on by GPTCLKGR.AM_CLK_EN
//
// ENUMs can be combined
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
// ENUMs:
// GPT3                     Enable clock for GPT3
// GPT2                     Enable clock for GPT2
// GPT1                     Enable clock for GPT1
// GPT0                     Enable clock for GPT0
#define PRCM_GPTCLKGS_CLK_EN_W                                               4
#define PRCM_GPTCLKGS_CLK_EN_M                                      0x0000000F
#define PRCM_GPTCLKGS_CLK_EN_S                                               0
#define PRCM_GPTCLKGS_CLK_EN_GPT3                                   0x00000008
#define PRCM_GPTCLKGS_CLK_EN_GPT2                                   0x00000004
#define PRCM_GPTCLKGS_CLK_EN_GPT1                                   0x00000002
#define PRCM_GPTCLKGS_CLK_EN_GPT0                                   0x00000001

//*****************************************************************************
//
// Register: PRCM_O_GPTCLKGDS
//
//*****************************************************************************
// Field:   [3:0] CLK_EN
//
// Each bit below has the following meaning:
//
// 0: Disable clock
// 1: Enable clock
//
// Can be forced on by GPTCLKGR.AM_CLK_EN
//
// ENUMs can be combined
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
// ENUMs:
// GPT3                     Enable clock for GPT3
// GPT2                     Enable clock for GPT2
// GPT1                     Enable clock for GPT1
// GPT0                     Enable clock for GPT0
#define PRCM_GPTCLKGDS_CLK_EN_W                                              4
#define PRCM_GPTCLKGDS_CLK_EN_M                                     0x0000000F
#define PRCM_GPTCLKGDS_CLK_EN_S                                              0
#define PRCM_GPTCLKGDS_CLK_EN_GPT3                                  0x00000008
#define PRCM_GPTCLKGDS_CLK_EN_GPT2                                  0x00000004
#define PRCM_GPTCLKGDS_CLK_EN_GPT1                                  0x00000002
#define PRCM_GPTCLKGDS_CLK_EN_GPT0                                  0x00000001

//*****************************************************************************
//
// Register: PRCM_O_I2CCLKGR
//
//*****************************************************************************
// Field:   [9:8] AM_CLK_EN
//
//
// 0: No force
// 1: Force clock on for all modes (Run, Sleep and Deep Sleep)
//
// Overrides CLK_EN,  I2CCLKGS.CLK_EN and  I2CCLKGDS.CLK_EN when enabled.
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
// ENUMs:
// I2C1                     Enable clock for I2C1
// I2C0                     Enable clock for I2C0
#define PRCM_I2CCLKGR_AM_CLK_EN_W                                            2
#define PRCM_I2CCLKGR_AM_CLK_EN_M                                   0x00000300
#define PRCM_I2CCLKGR_AM_CLK_EN_S                                            8
#define PRCM_I2CCLKGR_AM_CLK_EN_I2C1                                0x00000200
#define PRCM_I2CCLKGR_AM_CLK_EN_I2C0                                0x00000100

// Field:   [1:0] CLK_EN
//
//
// 0: Disable clock
// 1: Enable clock
//
// Can be forced on by AM_CLK_EN
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
// ENUMs:
// I2C1                     Enable clock for I2C1
// I2C0                     Enable clock for I2C0
#define PRCM_I2CCLKGR_CLK_EN_W                                               2
#define PRCM_I2CCLKGR_CLK_EN_M                                      0x00000003
#define PRCM_I2CCLKGR_CLK_EN_S                                               0
#define PRCM_I2CCLKGR_CLK_EN_I2C1                                   0x00000002
#define PRCM_I2CCLKGR_CLK_EN_I2C0                                   0x00000001

//*****************************************************************************
//
// Register: PRCM_O_I2CCLKGS
//
//*****************************************************************************
// Field:   [1:0] CLK_EN
//
//
// 0: Disable clock
// 1: Enable clock
//
// Can be forced on by I2CCLKGR.AM_CLK_EN
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
// ENUMs:
// I2C1                     Enable clock for I2C1
// I2C0                     Enable clock for I2C0
#define PRCM_I2CCLKGS_CLK_EN_W                                               2
#define PRCM_I2CCLKGS_CLK_EN_M                                      0x00000003
#define PRCM_I2CCLKGS_CLK_EN_S                                               0
#define PRCM_I2CCLKGS_CLK_EN_I2C1                                   0x00000002
#define PRCM_I2CCLKGS_CLK_EN_I2C0                                   0x00000001

//*****************************************************************************
//
// Register: PRCM_O_I2CCLKGDS
//
//*****************************************************************************
// Field:     [0] CLK_EN
//
//
// 0: Disable clock
// 1: Enable clock
//
// Can be forced on by I2CCLKGR.AM_CLK_EN
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
// ENUMs:
// I2C1                     Enable clock for I2C1
// I2C0                     Enable clock for I2C0
#define PRCM_I2CCLKGDS_CLK_EN                                       0x00000001
#define PRCM_I2CCLKGDS_CLK_EN_BITN                                           0
#define PRCM_I2CCLKGDS_CLK_EN_M                                     0x00000001
#define PRCM_I2CCLKGDS_CLK_EN_S                                              0
#define PRCM_I2CCLKGDS_CLK_EN_I2C1                                  0x00000002
#define PRCM_I2CCLKGDS_CLK_EN_I2C0                                  0x00000001

//*****************************************************************************
//
// Register: PRCM_O_UARTCLKGR
//
//*****************************************************************************
// Field:  [11:8] AM_CLK_EN
//
//
// 0: No force
// 1: Force clock on for all modes (Run, Sleep and Deep Sleep)
//
// Overrides CLK_EN,  UARTCLKGS.CLK_EN and  UARTCLKGDS.CLK_EN when enabled.
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
// ENUMs:
// UART3                    Enable clock for UART3
// UART2                    Enable clock for UART2
// UART1                    Enable clock for UART1
// UART0                    Enable clock for UART0
#define PRCM_UARTCLKGR_AM_CLK_EN_W                                           4
#define PRCM_UARTCLKGR_AM_CLK_EN_M                                  0x00000F00
#define PRCM_UARTCLKGR_AM_CLK_EN_S                                           8
#define PRCM_UARTCLKGR_AM_CLK_EN_UART3                              0x00000800
#define PRCM_UARTCLKGR_AM_CLK_EN_UART2                              0x00000400
#define PRCM_UARTCLKGR_AM_CLK_EN_UART1                              0x00000200
#define PRCM_UARTCLKGR_AM_CLK_EN_UART0                              0x00000100

