espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_prcm.h
// Field:   [3:0] CLK_EN
//
//
// 0: Disable clock
// 1: Enable clock
//
// Can be forced on by AM_CLK_EN
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
// ENUMs:
// UART3                    Enable clock for UART3
// UART2                    Enable clock for UART2
// UART1                    Enable clock for UART1
// UART0                    Enable clock for UART0
#define PRCM_UARTCLKGR_CLK_EN_W                                              4
#define PRCM_UARTCLKGR_CLK_EN_M                                     0x0000000F
#define PRCM_UARTCLKGR_CLK_EN_S                                              0
#define PRCM_UARTCLKGR_CLK_EN_UART3                                 0x00000008
#define PRCM_UARTCLKGR_CLK_EN_UART2                                 0x00000004
#define PRCM_UARTCLKGR_CLK_EN_UART1                                 0x00000002
#define PRCM_UARTCLKGR_CLK_EN_UART0                                 0x00000001

//*****************************************************************************
//
// Register: PRCM_O_UARTCLKGS
//
//*****************************************************************************
// Field:   [3:0] CLK_EN
//
//
// 0: Disable clock
// 1: Enable clock
//
// Can be forced on by UARTCLKGR.AM_CLK_EN
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
// ENUMs:
// UART3                    Enable clock for UART3
// UART2                    Enable clock for UART2
// UART1                    Enable clock for UART1
// UART0                    Enable clock for UART0
#define PRCM_UARTCLKGS_CLK_EN_W                                              4
#define PRCM_UARTCLKGS_CLK_EN_M                                     0x0000000F
#define PRCM_UARTCLKGS_CLK_EN_S                                              0
#define PRCM_UARTCLKGS_CLK_EN_UART3                                 0x00000008
#define PRCM_UARTCLKGS_CLK_EN_UART2                                 0x00000004
#define PRCM_UARTCLKGS_CLK_EN_UART1                                 0x00000002
#define PRCM_UARTCLKGS_CLK_EN_UART0                                 0x00000001

//*****************************************************************************
//
// Register: PRCM_O_UARTCLKGDS
//
//*****************************************************************************
// Field:   [3:0] CLK_EN
//
//
// 0: Disable clock
// 1: Enable clock
//
// Can be forced on by UARTCLKGR.AM_CLK_EN
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
// ENUMs:
// UART3                    Enable clock for UART3
// UART2                    Enable clock for UART2
// UART1                    Enable clock for UART1
// UART0                    Enable clock for UART0
#define PRCM_UARTCLKGDS_CLK_EN_W                                             4
#define PRCM_UARTCLKGDS_CLK_EN_M                                    0x0000000F
#define PRCM_UARTCLKGDS_CLK_EN_S                                             0
#define PRCM_UARTCLKGDS_CLK_EN_UART3                                0x00000008
#define PRCM_UARTCLKGDS_CLK_EN_UART2                                0x00000004
#define PRCM_UARTCLKGDS_CLK_EN_UART1                                0x00000002
#define PRCM_UARTCLKGDS_CLK_EN_UART0                                0x00000001

//*****************************************************************************
//
// Register: PRCM_O_SSICLKGR
//
//*****************************************************************************
// Field:  [11:8] AM_CLK_EN
//
//
// 0: No force
// 1: Force clock on for all modes (Run, Sleep and Deep Sleep)
//
// Overrides CLK_EN,  SSICLKGS.CLK_EN and  SSICLKGDS.CLK_EN when enabled.
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
// ENUMs:
// SSI3                     Enable clock for SSI3
// SSI2                     Enable clock for SSI2
// SSI1                     Enable clock for SSI1
// SSI0                     Enable clock for SSI0
#define PRCM_SSICLKGR_AM_CLK_EN_W                                            4
#define PRCM_SSICLKGR_AM_CLK_EN_M                                   0x00000F00
#define PRCM_SSICLKGR_AM_CLK_EN_S                                            8
#define PRCM_SSICLKGR_AM_CLK_EN_SSI3                                0x00000800
#define PRCM_SSICLKGR_AM_CLK_EN_SSI2                                0x00000400
#define PRCM_SSICLKGR_AM_CLK_EN_SSI1                                0x00000200
#define PRCM_SSICLKGR_AM_CLK_EN_SSI0                                0x00000100

// Field:   [3:0] CLK_EN
//
//
// 0: Disable clock
// 1: Enable clock
//
// Can be forced on by AM_CLK_EN
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
// ENUMs:
// SSI3                     Enable clock for SSI3
// SSI2                     Enable clock for SSI2
// SSI1                     Enable clock for SSI1
// SSI0                     Enable clock for SSI0
#define PRCM_SSICLKGR_CLK_EN_W                                               4
#define PRCM_SSICLKGR_CLK_EN_M                                      0x0000000F
#define PRCM_SSICLKGR_CLK_EN_S                                               0
#define PRCM_SSICLKGR_CLK_EN_SSI3                                   0x00000008
#define PRCM_SSICLKGR_CLK_EN_SSI2                                   0x00000004
#define PRCM_SSICLKGR_CLK_EN_SSI1                                   0x00000002
#define PRCM_SSICLKGR_CLK_EN_SSI0                                   0x00000001

//*****************************************************************************
//
// Register: PRCM_O_SSICLKGS
//
//*****************************************************************************
// Field:   [3:0] CLK_EN
//
//
// 0: Disable clock
// 1: Enable clock
//
// Can be forced on by SSICLKGR.AM_CLK_EN
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
// ENUMs:
// SSI3                     Enable clock for SSI3
// SSI2                     Enable clock for SSI2
// SSI1                     Enable clock for SSI1
// SSI0                     Enable clock for SSI0
#define PRCM_SSICLKGS_CLK_EN_W                                               4
#define PRCM_SSICLKGS_CLK_EN_M                                      0x0000000F
#define PRCM_SSICLKGS_CLK_EN_S                                               0
#define PRCM_SSICLKGS_CLK_EN_SSI3                                   0x00000008
#define PRCM_SSICLKGS_CLK_EN_SSI2                                   0x00000004
#define PRCM_SSICLKGS_CLK_EN_SSI1                                   0x00000002
#define PRCM_SSICLKGS_CLK_EN_SSI0                                   0x00000001

//*****************************************************************************
//
// Register: PRCM_O_SSICLKGDS
//
//*****************************************************************************
// Field:   [3:0] CLK_EN
//
//
// 0: Disable clock
// 1: Enable clock
//
// Can be forced on by SSICLKGR.AM_CLK_EN
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
// ENUMs:
// SSI3                     Enable clock for SSI3
// SSI2                     Enable clock for SSI2
// SSI1                     Enable clock for SSI1
// SSI0                     Enable clock for SSI0
#define PRCM_SSICLKGDS_CLK_EN_W                                              4
#define PRCM_SSICLKGDS_CLK_EN_M                                     0x0000000F
#define PRCM_SSICLKGDS_CLK_EN_S                                              0
#define PRCM_SSICLKGDS_CLK_EN_SSI3                                  0x00000008
#define PRCM_SSICLKGDS_CLK_EN_SSI2                                  0x00000004
#define PRCM_SSICLKGDS_CLK_EN_SSI1                                  0x00000002
#define PRCM_SSICLKGDS_CLK_EN_SSI0                                  0x00000001

//*****************************************************************************
//
// Register: PRCM_O_I2SCLKGR
//
//*****************************************************************************
// Field:     [8] AM_CLK_EN
//
//
// 0: No force
// 1: Force clock on for all modes (Run, Sleep and Deep Sleep)
//
// Overrides CLK_EN,  I2SCLKGS.CLK_EN and  I2SCLKGDS.CLK_EN when enabled.
// SYSBUS clock will always run when enabled
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
#define PRCM_I2SCLKGR_AM_CLK_EN                                     0x00000100
#define PRCM_I2SCLKGR_AM_CLK_EN_BITN                                         8
#define PRCM_I2SCLKGR_AM_CLK_EN_M                                   0x00000100
#define PRCM_I2SCLKGR_AM_CLK_EN_S                                            8

// Field:     [0] CLK_EN
//
//
// 0: Disable clock
// 1: Enable clock
//
// Can be forced on by AM_CLK_EN
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
#define PRCM_I2SCLKGR_CLK_EN                                        0x00000001
#define PRCM_I2SCLKGR_CLK_EN_BITN                                            0
#define PRCM_I2SCLKGR_CLK_EN_M                                      0x00000001
#define PRCM_I2SCLKGR_CLK_EN_S                                               0

//*****************************************************************************
//
// Register: PRCM_O_I2SCLKGS
//
//*****************************************************************************
// Field:     [0] CLK_EN
//
//
// 0: Disable clock
// 1: Enable clock
//
// Can be forced on by I2SCLKGR.AM_CLK_EN
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
#define PRCM_I2SCLKGS_CLK_EN                                        0x00000001
#define PRCM_I2SCLKGS_CLK_EN_BITN                                            0
#define PRCM_I2SCLKGS_CLK_EN_M                                      0x00000001
#define PRCM_I2SCLKGS_CLK_EN_S                                               0

//*****************************************************************************
//
// Register: PRCM_O_I2SCLKGDS
//
//*****************************************************************************
// Field:     [0] CLK_EN
//
//
// 0: Disable clock
// 1: Enable clock
//
// SYSBUS clock will always run when enabled
//
// Can be forced on by I2SCLKGR.AM_CLK_EN
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
#define PRCM_I2SCLKGDS_CLK_EN                                       0x00000001
#define PRCM_I2SCLKGDS_CLK_EN_BITN                                           0
#define PRCM_I2SCLKGDS_CLK_EN_M                                     0x00000001
#define PRCM_I2SCLKGDS_CLK_EN_S                                              0

//*****************************************************************************
//
// Register: PRCM_O_SYSBUSCLKDIV
//
//*****************************************************************************
// Field:   [2:0] RATIO
//
// Internal. Only to be used through TI provided API.
// ENUMs:
// DIV2                     Internal. Only to be used through TI provided API.
// DIV1                     Internal. Only to be used through TI provided API.
#define PRCM_SYSBUSCLKDIV_RATIO_W                                            3
#define PRCM_SYSBUSCLKDIV_RATIO_M                                   0x00000007
#define PRCM_SYSBUSCLKDIV_RATIO_S                                            0
#define PRCM_SYSBUSCLKDIV_RATIO_DIV2                                0x00000001
#define PRCM_SYSBUSCLKDIV_RATIO_DIV1                                0x00000000

//*****************************************************************************
//
// Register: PRCM_O_CPUCLKDIV
//
//*****************************************************************************
// Field:     [0] RATIO
//
// Internal. Only to be used through TI provided API.
// ENUMs:
// DIV2                     Internal. Only to be used through TI provided API.
// DIV1                     Internal. Only to be used through TI provided API.
#define PRCM_CPUCLKDIV_RATIO                                        0x00000001
#define PRCM_CPUCLKDIV_RATIO_BITN                                            0
#define PRCM_CPUCLKDIV_RATIO_M                                      0x00000001
#define PRCM_CPUCLKDIV_RATIO_S                                               0
#define PRCM_CPUCLKDIV_RATIO_DIV2                                   0x00000001
#define PRCM_CPUCLKDIV_RATIO_DIV1                                   0x00000000

//*****************************************************************************
//
// Register: PRCM_O_PERBUSCPUCLKDIV
//
//*****************************************************************************
// Field:   [3:0] RATIO
//
// Internal. Only to be used through TI provided API.
// ENUMs:
// DIV256                   Internal. Only to be used through TI provided API.
// DIV128                   Internal. Only to be used through TI provided API.
// DIV64                    Internal. Only to be used through TI provided API.
// DIV32                    Internal. Only to be used through TI provided API.
// DIV16                    Internal. Only to be used through TI provided API.
// DIV8                     Internal. Only to be used through TI provided API.
// DIV4                     Internal. Only to be used through TI provided API.
// DIV2                     Internal. Only to be used through TI provided API.
// DIV1                     Internal. Only to be used through TI provided API.
#define PRCM_PERBUSCPUCLKDIV_RATIO_W                                         4
#define PRCM_PERBUSCPUCLKDIV_RATIO_M                                0x0000000F
#define PRCM_PERBUSCPUCLKDIV_RATIO_S                                         0
#define PRCM_PERBUSCPUCLKDIV_RATIO_DIV256                           0x00000008
#define PRCM_PERBUSCPUCLKDIV_RATIO_DIV128                           0x00000007
#define PRCM_PERBUSCPUCLKDIV_RATIO_DIV64                            0x00000006
#define PRCM_PERBUSCPUCLKDIV_RATIO_DIV32                            0x00000005
#define PRCM_PERBUSCPUCLKDIV_RATIO_DIV16                            0x00000004
#define PRCM_PERBUSCPUCLKDIV_RATIO_DIV8                             0x00000003
#define PRCM_PERBUSCPUCLKDIV_RATIO_DIV4                             0x00000002
#define PRCM_PERBUSCPUCLKDIV_RATIO_DIV2                             0x00000001
#define PRCM_PERBUSCPUCLKDIV_RATIO_DIV1                             0x00000000

//*****************************************************************************
//
// Register: PRCM_O_PERDMACLKDIV
//
//*****************************************************************************
// Field:   [3:0] RATIO
//
// Internal. Only to be used through TI provided API.
// ENUMs:
// DIV256                   Internal. Only to be used through TI provided API.
// DIV128                   Internal. Only to be used through TI provided API.
// DIV64                    Internal. Only to be used through TI provided API.
// DIV32                    Internal. Only to be used through TI provided API.
// DIV16                    Internal. Only to be used through TI provided API.
// DIV8                     Internal. Only to be used through TI provided API.
// DIV4                     Internal. Only to be used through TI provided API.
// DIV2                     Internal. Only to be used through TI provided API.
// DIV1                     Internal. Only to be used through TI provided API.
#define PRCM_PERDMACLKDIV_RATIO_W                                            4
#define PRCM_PERDMACLKDIV_RATIO_M                                   0x0000000F
#define PRCM_PERDMACLKDIV_RATIO_S                                            0
#define PRCM_PERDMACLKDIV_RATIO_DIV256                              0x00000008
#define PRCM_PERDMACLKDIV_RATIO_DIV128                              0x00000007
#define PRCM_PERDMACLKDIV_RATIO_DIV64                               0x00000006
#define PRCM_PERDMACLKDIV_RATIO_DIV32                               0x00000005
#define PRCM_PERDMACLKDIV_RATIO_DIV16                               0x00000004
#define PRCM_PERDMACLKDIV_RATIO_DIV8                                0x00000003
#define PRCM_PERDMACLKDIV_RATIO_DIV4                                0x00000002
#define PRCM_PERDMACLKDIV_RATIO_DIV2                                0x00000001
#define PRCM_PERDMACLKDIV_RATIO_DIV1                                0x00000000

//*****************************************************************************
//
// Register: PRCM_O_I2SBCLKSEL
//
//*****************************************************************************
// Field:     [0] SRC
//
// BCLK source selector
//
// 0: Use external BCLK
// 1: Use internally generated clock
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
#define PRCM_I2SBCLKSEL_SRC                                         0x00000001
#define PRCM_I2SBCLKSEL_SRC_BITN                                             0
#define PRCM_I2SBCLKSEL_SRC_M                                       0x00000001
#define PRCM_I2SBCLKSEL_SRC_S                                                0

//*****************************************************************************
//
// Register: PRCM_O_GPTCLKDIV
//
//*****************************************************************************
// Field:   [3:0] RATIO
//
// Scalar used for GPTs. The division rate will be constant and ungated for Run
// / Sleep / DeepSleep mode.   For changes to take effect, CLKLOADCTL.LOAD
// needs to be written Other values are not supported.
// ENUMs:
// DIV256                   Divide by 256
// DIV128                   Divide by 128
// DIV64                    Divide by 64
// DIV32                    Divide by 32
// DIV16                    Divide by 16
// DIV8                     Divide by 8
// DIV4                     Divide by 4
// DIV2                     Divide by 2
// DIV1                     Divide by 1
#define PRCM_GPTCLKDIV_RATIO_W                                               4
#define PRCM_GPTCLKDIV_RATIO_M                                      0x0000000F
#define PRCM_GPTCLKDIV_RATIO_S                                               0
#define PRCM_GPTCLKDIV_RATIO_DIV256                                 0x00000008
#define PRCM_GPTCLKDIV_RATIO_DIV128                                 0x00000007
#define PRCM_GPTCLKDIV_RATIO_DIV64                                  0x00000006
#define PRCM_GPTCLKDIV_RATIO_DIV32                                  0x00000005
#define PRCM_GPTCLKDIV_RATIO_DIV16                                  0x00000004
#define PRCM_GPTCLKDIV_RATIO_DIV8                                   0x00000003
#define PRCM_GPTCLKDIV_RATIO_DIV4                                   0x00000002
#define PRCM_GPTCLKDIV_RATIO_DIV2                                   0x00000001
#define PRCM_GPTCLKDIV_RATIO_DIV1                                   0x00000000

//*****************************************************************************
//
// Register: PRCM_O_I2SCLKCTL
//
//*****************************************************************************
// Field:     [3] SMPL_ON_POSEDGE
//
// On the I2S serial interface, data and WCLK is sampled and clocked out on
// opposite edges of BCLK.
//
// 0 - data and WCLK are sampled on the negative edge and clocked out on the
// positive edge.
// 1 - data and WCLK are sampled on the positive edge and clocked out on the
// negative edge.
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
#define PRCM_I2SCLKCTL_SMPL_ON_POSEDGE                              0x00000008
#define PRCM_I2SCLKCTL_SMPL_ON_POSEDGE_BITN                                  3
#define PRCM_I2SCLKCTL_SMPL_ON_POSEDGE_M                            0x00000008
#define PRCM_I2SCLKCTL_SMPL_ON_POSEDGE_S                                     3

