espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_prcm.h
// Field:     [2] RCOSCLFIM
//
// 0: Disable interrupt generation when RCOSCLF is qualified
// 1: Enable interrupt generation when RCOSCLF is qualified
#define PRCM_OSCIMSC_RCOSCLFIM                                      0x00000004
#define PRCM_OSCIMSC_RCOSCLFIM_BITN                                          2
#define PRCM_OSCIMSC_RCOSCLFIM_M                                    0x00000004
#define PRCM_OSCIMSC_RCOSCLFIM_S                                             2

// Field:     [1] XOSCHFIM
//
// 0: Disable interrupt generation when XOSCHF is qualified
// 1: Enable interrupt generation when XOSCHF is qualified
#define PRCM_OSCIMSC_XOSCHFIM                                       0x00000002
#define PRCM_OSCIMSC_XOSCHFIM_BITN                                           1
#define PRCM_OSCIMSC_XOSCHFIM_M                                     0x00000002
#define PRCM_OSCIMSC_XOSCHFIM_S                                              1

// Field:     [0] RCOSCHFIM
//
// 0: Disable interrupt generation when RCOSCHF is qualified
// 1: Enable interrupt generation when RCOSCHF is qualified
#define PRCM_OSCIMSC_RCOSCHFIM                                      0x00000001
#define PRCM_OSCIMSC_RCOSCHFIM_BITN                                          0
#define PRCM_OSCIMSC_RCOSCHFIM_M                                    0x00000001
#define PRCM_OSCIMSC_RCOSCHFIM_S                                             0

//*****************************************************************************
//
// Register: PRCM_O_OSCRIS
//
//*****************************************************************************
// Field:     [7] HFSRCPENDRIS
//
// SCLK_HF source switch pending interrupt.
//
// After a write to DDI_0_OSC:CTL0.SCLK_HF_SRC_SEL leads to a SCLK_HF source
// change request, then the requested SCLK_HF source will be enabled and
// qualified. When the new source is ready to be used as a clock source, then
// the interrupt HSSRCPENDRIS will go high. When the Flash allows SCLK_HF
// source switching to take place after flash memory read access is disabled.
// At this time the actual SCLK_HF clock source switch will be performed, and
// the interrupt status HSSRCPENDRIS will go low.
//
// 0: Indicates SCLK_HF source is not ready to be switched
// 1: Indicates SCLK_HF source is ready to be switched
//
// Interrupt is qualified regardless of OSCIMSC.HFSRCPENDIM setting. The order
// of qualifying raw interrupt and enable of interrupt mask is indifferent for
// generating an OSC Interrupt.
//
// Set by HW. Cleared by writing to OSCICR.HFSRCPENDC
#define PRCM_OSCRIS_HFSRCPENDRIS                                    0x00000080
#define PRCM_OSCRIS_HFSRCPENDRIS_BITN                                        7
#define PRCM_OSCRIS_HFSRCPENDRIS_M                                  0x00000080
#define PRCM_OSCRIS_HFSRCPENDRIS_S                                           7

// Field:     [6] LFSRCDONERIS
//
// SCLK_LF source switch done.
//
// The DDI_0_OSC:CTL0.SCLK_LF_SRC_SEL  register field is used to request that
// the SCLK_LF source shall be changed. After an SCLK_LF clock source change is
// requested, the new source may need to be enabled and qualified before
// switching of clock source can be done. The interrupt LFRSRCDONERIS goes high
// to indicate that the SCLK_LF clock source switching has been performed.
// LFRSRCDONERIS will go low again when the next clock source change is
// requested by writing to DDI_0_OSC:CTL0.SCLK_LF_SRC_SEL .
//
// 0: Indicates SCLK_LF source switch has not completed
// 1: Indicates SCLK_LF source switch has completed
//
// Interrupt is qualified regardless of OSCIMSC.LFSRCDONEIM setting. The order
// of qualifying raw interrupt and enable of interrupt mask is indifferent for
// generating an OSC Interrupt.
//
// Set by HW. Cleared by writing to OSCICR.LFSRCDONEC
#define PRCM_OSCRIS_LFSRCDONERIS                                    0x00000040
#define PRCM_OSCRIS_LFSRCDONERIS_BITN                                        6
#define PRCM_OSCRIS_LFSRCDONERIS_M                                  0x00000040
#define PRCM_OSCRIS_LFSRCDONERIS_S                                           6

// Field:     [5] XOSCDLFRIS
//
// The XOSCDLFRIS interrupt indicates when the XOSC_HF oscillator is ready to
// be used as a derived low-frequency clock source for SCLK_LF or ACLK_REF.
// When XOSCDLFRIS is high, XOSC_HF  will be used as source for SCLK_LF when
// selected. When none of the system clocks have XOSC_HF selected as clock
// source, the XOSC_HF source is automatically disabled and the XOSCDLFRIS
// interrupt status will go low.
//
// 0: XOSCDLF has not been qualified
// 1: XOSCDLF has been qualified
//
// Interrupt is qualified regardless of OSCIMSC.XOSCDLFIM setting. The order of
// qualifying raw interrupt and enable of interrupt mask is indifferent for
// generating an OSC Interrupt.
//
// Set by HW. Cleared by writing to OSCICR.XOSCDLFC
#define PRCM_OSCRIS_XOSCDLFRIS                                      0x00000020
#define PRCM_OSCRIS_XOSCDLFRIS_BITN                                          5
#define PRCM_OSCRIS_XOSCDLFRIS_M                                    0x00000020
#define PRCM_OSCRIS_XOSCDLFRIS_S                                             5

// Field:     [4] XOSCLFRIS
//
// The XOSCLFRIS interrupt indicates when the output of the XOSC_LF oscillator
// has been qualified with respect to frequency. The XOSCLFRIS interrupt status
// goes high when the XOSC_LF oscillator is ready to be used as a clock source.
// After the clock qualification is successful, XOSCLFRIS interrupt status
// remains high, and further qualification is turned off until the XOSC_LF
// oscillator is disabled. XOSCLFRIS interrupt status will go low only at
// initial power-on, or after the XOSC_LF oscillator has been disabled when
// being deselected as a clock source.
//
// 0: XOSCLF has not been qualified
// 1: XOSCLF has been qualified
//
// Interrupt is qualified regardless of OSCIMSC.XOSCLFIM setting. The order of
// qualifying raw interrupt and enable of interrupt mask is indifferent for
// generating an OSC Interrupt.
//
// Set by HW. Cleared by writing to OSCICR.XOSCLFC
#define PRCM_OSCRIS_XOSCLFRIS                                       0x00000010
#define PRCM_OSCRIS_XOSCLFRIS_BITN                                           4
#define PRCM_OSCRIS_XOSCLFRIS_M                                     0x00000010
#define PRCM_OSCRIS_XOSCLFRIS_S                                              4

// Field:     [3] RCOSCDLFRIS
//
// The RCOSCDLFRIS interrupt indicates when the RCOSC_HF oscillator is ready to
// be used as a derived low-frequency clock source for SCLK_LF or ACLK_REF.
// When RCOSCDLFRIS is high, RCOSC_HF will be used as source for SCLK_LF when
// selected. When none of the system clocks have RCOSC_HF selected as clock
// source, the RCOSC_HF source is automatically disabled and the RCOSCDLFRIS
// interrupt status will go low.
// If the SCLK_LF or ACLK_REF source is changed from RCOSC_HF derived to
// XOSC_HF derived low-frequency clock and the new source has not been
// qualified, then the clock will remain running on the original source. The
// RCOSCDLFRIS interrupt will then remain high.
//
// 0: RCOSCDLF has not been qualified
// 1: RCOSCDLF has been qualified
//
// Interrupt is qualified regardless of OSCIMSC.RCOSCDLFIM setting. The order
// of qualifying raw interrupt and enable of interrupt mask is indifferent for
// generating an OSC Interrupt.
//
// Set by HW. Cleared by writing to OSCICR.RCOSCDLFC
#define PRCM_OSCRIS_RCOSCDLFRIS                                     0x00000008
#define PRCM_OSCRIS_RCOSCDLFRIS_BITN                                         3
#define PRCM_OSCRIS_RCOSCDLFRIS_M                                   0x00000008
#define PRCM_OSCRIS_RCOSCDLFRIS_S                                            3

// Field:     [2] RCOSCLFRIS
//
// The RCOSCLFRIS interrupt indicates when the output of the RCOSC_LF
// oscillator has been qualified with respect to frequency. The RCOSCLFRIS
// interrupt status goes high when the RCOSC_LF oscillator is ready to be used
// as a clock source.
// After the clock qualification is successful, RCOSCLFRIS interrupt status
// remains high, and further qualification is turned off until the RCOSC_LF
// oscillator is disabled. RCOSCLFRIS interrupt status will go low only at
// initial power-on, or after the RCOSC_LF oscillator has been disabled when
// being deselected as a clock source.
//
// 0: RCOSCLF has not been qualified
// 1: RCOSCLF has been qualified
//
// Interrupt is qualified regardless of OSCIMSC.RCOSCLFIM setting. The order of
// qualifying raw interrupt and enable of interrupt mask is indifferent for
// generating an OSC Interrupt.
//
// Set by HW. Cleared by writing to OSCICR.RCOSCLFC
#define PRCM_OSCRIS_RCOSCLFRIS                                      0x00000004
#define PRCM_OSCRIS_RCOSCLFRIS_BITN                                          2
#define PRCM_OSCRIS_RCOSCLFRIS_M                                    0x00000004
#define PRCM_OSCRIS_RCOSCLFRIS_S                                             2

// Field:     [1] XOSCHFRIS
//
// The XOSCHFRIS interrupt indicates when the XOSC_HF oscillator has been
// qualified for use as a clock source. XOSCHFRIS is also used in TCXO mode
// (when DDI_0_OSC:XOSCHFCTL.TCXO_MODE is 1).
// When the XOSCHFRIS interrupt is high, the oscillator is qualified and will
// be used as a clock source when selected. The XOSCHFRIS interrupt goes low
// when the oscillator is disabled after being deselected as a clock source.
//
//
// 0: XOSC_HF has not been qualified
// 1: XOSC_HF has been qualified
//
// Interrupt is qualified regardless of OSCIMSC.XOSCHFIM setting. The order of
// qualifying raw interrupt and enable of interrupt mask is indifferent for
// generating an OSC Interrupt.
//
// Set by HW. Cleared by writing to OSCICR.XOSCHFC
#define PRCM_OSCRIS_XOSCHFRIS                                       0x00000002
#define PRCM_OSCRIS_XOSCHFRIS_BITN                                           1
#define PRCM_OSCRIS_XOSCHFRIS_M                                     0x00000002
#define PRCM_OSCRIS_XOSCHFRIS_S                                              1

// Field:     [0] RCOSCHFRIS
//
// The RCOSCHFRIS interrupt indicates when the RCOSC_HF oscillator has been
// qualified for use as a clock source When the RCOSCHFRIS interrupt is high,
// the oscillator is qualified and will be used as a clock source when
// selected. The RCOSCHFRIS interrupt goes low when the oscillator is disabled
// after being deselected as a clock source.
//
// 0: RCOSC_HF has not been qualified
// 1: RCOSC_HF has been qualified
//
// Interrupt is qualified regardless of OSCIMSC.RCOSCHFIM setting. The order of
// qualifying raw interrupt and enable of interrupt mask is indifferent for
// generating an OSC Interrupt.
//
// Set by HW. Cleared by writing to OSCICR.RCOSCHFC
#define PRCM_OSCRIS_RCOSCHFRIS                                      0x00000001
#define PRCM_OSCRIS_RCOSCHFRIS_BITN                                          0
#define PRCM_OSCRIS_RCOSCHFRIS_M                                    0x00000001
#define PRCM_OSCRIS_RCOSCHFRIS_S                                             0

//*****************************************************************************
//
// Register: PRCM_O_OSCICR
//
//*****************************************************************************
// Field:     [7] HFSRCPENDC
//
// Writing 1 to this field clears the HFSRCPEND raw interrupt status. Writing 0
// has no effect.
#define PRCM_OSCICR_HFSRCPENDC                                      0x00000080
#define PRCM_OSCICR_HFSRCPENDC_BITN                                          7
#define PRCM_OSCICR_HFSRCPENDC_M                                    0x00000080
#define PRCM_OSCICR_HFSRCPENDC_S                                             7

// Field:     [6] LFSRCDONEC
//
// Writing 1 to this field clears the LFSRCDONE raw interrupt status. Writing 0
// has no effect.
#define PRCM_OSCICR_LFSRCDONEC                                      0x00000040
#define PRCM_OSCICR_LFSRCDONEC_BITN                                          6
#define PRCM_OSCICR_LFSRCDONEC_M                                    0x00000040
#define PRCM_OSCICR_LFSRCDONEC_S                                             6

// Field:     [5] XOSCDLFC
//
// Writing 1 to this field clears the XOSCDLF raw interrupt status. Writing 0
// has no effect.
#define PRCM_OSCICR_XOSCDLFC                                        0x00000020
#define PRCM_OSCICR_XOSCDLFC_BITN                                            5
#define PRCM_OSCICR_XOSCDLFC_M                                      0x00000020
#define PRCM_OSCICR_XOSCDLFC_S                                               5

// Field:     [4] XOSCLFC
//
// Writing 1 to this field clears the XOSCLF raw interrupt status. Writing 0
// has no effect.
#define PRCM_OSCICR_XOSCLFC                                         0x00000010
#define PRCM_OSCICR_XOSCLFC_BITN                                             4
#define PRCM_OSCICR_XOSCLFC_M                                       0x00000010
#define PRCM_OSCICR_XOSCLFC_S                                                4

// Field:     [3] RCOSCDLFC
//
// Writing 1 to this field clears the RCOSCDLF raw interrupt status. Writing 0
// has no effect.
#define PRCM_OSCICR_RCOSCDLFC                                       0x00000008
#define PRCM_OSCICR_RCOSCDLFC_BITN                                           3
#define PRCM_OSCICR_RCOSCDLFC_M                                     0x00000008
#define PRCM_OSCICR_RCOSCDLFC_S                                              3

// Field:     [2] RCOSCLFC
//
// Writing 1 to this field clears the RCOSCLF raw interrupt status. Writing 0
// has no effect.
#define PRCM_OSCICR_RCOSCLFC                                        0x00000004
#define PRCM_OSCICR_RCOSCLFC_BITN                                            2
#define PRCM_OSCICR_RCOSCLFC_M                                      0x00000004
#define PRCM_OSCICR_RCOSCLFC_S                                               2

// Field:     [1] XOSCHFC
//
// Writing 1 to this field clears the XOSCHF raw interrupt status. Writing 0
// has no effect.
#define PRCM_OSCICR_XOSCHFC                                         0x00000002
#define PRCM_OSCICR_XOSCHFC_BITN                                             1
#define PRCM_OSCICR_XOSCHFC_M                                       0x00000002
#define PRCM_OSCICR_XOSCHFC_S                                                1

// Field:     [0] RCOSCHFC
//
// Writing 1 to this field clears the RCOSCHF raw interrupt status. Writing 0
// has no effect.
#define PRCM_OSCICR_RCOSCHFC                                        0x00000001
#define PRCM_OSCICR_RCOSCHFC_BITN                                            0
#define PRCM_OSCICR_RCOSCHFC_M                                      0x00000001
#define PRCM_OSCICR_RCOSCHFC_S                                               0

//*****************************************************************************
//
// Register: PRCM_O_NVMNSCADDR
//
//*****************************************************************************
// Field:    [31] PARITY
//
// Register parity bit.
#define PRCM_NVMNSCADDR_PARITY                                      0x80000000
#define PRCM_NVMNSCADDR_PARITY_BITN                                         31
#define PRCM_NVMNSCADDR_PARITY_M                                    0x80000000
#define PRCM_NVMNSCADDR_PARITY_S                                            31

// Field: [19:10] BOUNDARY
//
//
// Non-Secure callable   boundary address.
//
// Writing this field when BUSSECCFG.VALID is set may result in undefined
// behavior.
#define PRCM_NVMNSCADDR_BOUNDARY_W                                          10
#define PRCM_NVMNSCADDR_BOUNDARY_M                                  0x000FFC00
#define PRCM_NVMNSCADDR_BOUNDARY_S                                          10

//*****************************************************************************
//
// Register: PRCM_O_NVMNSADDR
//
//*****************************************************************************
// Field:    [31] PARITY
//
// Register parity bit
#define PRCM_NVMNSADDR_PARITY                                       0x80000000
#define PRCM_NVMNSADDR_PARITY_BITN                                          31
#define PRCM_NVMNSADDR_PARITY_M                                     0x80000000
#define PRCM_NVMNSADDR_PARITY_S                                             31

// Field:    [20] BOUNDARY_MSB
//
// Non-Secure boundary address MSB
//
// HW controlled.
#define PRCM_NVMNSADDR_BOUNDARY_MSB                                 0x00100000
#define PRCM_NVMNSADDR_BOUNDARY_MSB_BITN                                    20
#define PRCM_NVMNSADDR_BOUNDARY_MSB_M                               0x00100000
#define PRCM_NVMNSADDR_BOUNDARY_MSB_S                                       20

