espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_prcm.h
// Field: [19:13] BOUNDARY
//
//
// Non-Secure boundary address.
//
// Writing this field when BUSSECCFG.VALID is set may result in undefined
// behavior.
#define PRCM_NVMNSADDR_BOUNDARY_W                                            7
#define PRCM_NVMNSADDR_BOUNDARY_M                                   0x000FE000
#define PRCM_NVMNSADDR_BOUNDARY_S                                           13

//*****************************************************************************
//
// Register: PRCM_O_SRAMNSCADDR
//
//*****************************************************************************
// Field:    [31] PARITY
//
// Register parity bit
#define PRCM_SRAMNSCADDR_PARITY                                     0x80000000
#define PRCM_SRAMNSCADDR_PARITY_BITN                                        31
#define PRCM_SRAMNSCADDR_PARITY_M                                   0x80000000
#define PRCM_SRAMNSCADDR_PARITY_S                                           31

// Field: [18:10] BOUNDARY
//
//
// Non-Secure callable   boundary address.
//
// Writing this field when BUSSECCFG.VALID is set may result in undefined
// behavior.
#define PRCM_SRAMNSCADDR_BOUNDARY_W                                          9
#define PRCM_SRAMNSCADDR_BOUNDARY_M                                 0x0007FC00
#define PRCM_SRAMNSCADDR_BOUNDARY_S                                         10

//*****************************************************************************
//
// Register: PRCM_O_SRAMNSADDR
//
//*****************************************************************************
// Field:    [31] PARITY
//
// Register parity bit
#define PRCM_SRAMNSADDR_PARITY                                      0x80000000
#define PRCM_SRAMNSADDR_PARITY_BITN                                         31
#define PRCM_SRAMNSADDR_PARITY_M                                    0x80000000
#define PRCM_SRAMNSADDR_PARITY_S                                            31

// Field: [18:10] BOUNDARY
//
//
// Non-Secure boundary address.
//
// Writing this field when BUSSECCFG.VALID is set may result in undefined
// behavior.
#define PRCM_SRAMNSADDR_BOUNDARY_W                                           9
#define PRCM_SRAMNSADDR_BOUNDARY_M                                  0x0007FC00
#define PRCM_SRAMNSADDR_BOUNDARY_S                                          10

//*****************************************************************************
//
// Register: PRCM_O_BUSSECCFG
//
//*****************************************************************************
// Field:    [31] VALID
//
//
// Security  configuration valid
//
// Registers that needs to be followed by VALID before settings being applied
// are:
// - NVMNSCADDR
// - NVMNSADDR
// - SRAMNSCADDR
// - SRAMNSADDR
// - BUSSECCFG
// - CPULOCK
#define PRCM_BUSSECCFG_VALID                                        0x80000000
#define PRCM_BUSSECCFG_VALID_BITN                                           31
#define PRCM_BUSSECCFG_VALID_M                                      0x80000000
#define PRCM_BUSSECCFG_VALID_S                                              31

// Field:   [7:0] BUS_CFG
//
// Bus interconnect security and firewall configuration
#define PRCM_BUSSECCFG_BUS_CFG_W                                             8
#define PRCM_BUSSECCFG_BUS_CFG_M                                    0x000000FF
#define PRCM_BUSSECCFG_BUS_CFG_S                                             0

//*****************************************************************************
//
// Register: PRCM_O_CPULOCK
//
//*****************************************************************************
// Field:    [31] PARITY
//
// Register parity bit
#define PRCM_CPULOCK_PARITY                                         0x80000000
#define PRCM_CPULOCK_PARITY_BITN                                            31
#define PRCM_CPULOCK_PARITY_M                                       0x80000000
#define PRCM_CPULOCK_PARITY_S                                               31

// Field:     [4] LOCKNSVTOR
//
// When set will lock non-secure vector table base address
//
// Writing this field when BUSSECCFG.VALID is set may result in undefined
// behavior.
#define PRCM_CPULOCK_LOCKNSVTOR                                     0x00000010
#define PRCM_CPULOCK_LOCKNSVTOR_BITN                                         4
#define PRCM_CPULOCK_LOCKNSVTOR_M                                   0x00000010
#define PRCM_CPULOCK_LOCKNSVTOR_S                                            4

// Field:     [3] LOCKSVTAIRCR
//
// When set will lock
// - Secure vector table base address
// - Secure interrupt priority
// - Busfault
// - Hardfault NMI security target
//
// Writing this field when BUSSECCFG.VALID is set may result in undefined
// behavior.
#define PRCM_CPULOCK_LOCKSVTAIRCR                                   0x00000008
#define PRCM_CPULOCK_LOCKSVTAIRCR_BITN                                       3
#define PRCM_CPULOCK_LOCKSVTAIRCR_M                                 0x00000008
#define PRCM_CPULOCK_LOCKSVTAIRCR_S                                          3

// Field:     [2] LOCKSAU
//
// When set will lock SAU regions
//
// Writing this field when BUSSECCFG.VALID is set may result in undefined
// behavior.
#define PRCM_CPULOCK_LOCKSAU                                        0x00000004
#define PRCM_CPULOCK_LOCKSAU_BITN                                            2
#define PRCM_CPULOCK_LOCKSAU_M                                      0x00000004
#define PRCM_CPULOCK_LOCKSAU_S                                               2

// Field:     [1] LOCKNSMPU
//
// When set will lock non-secure MPU
//
// Writing this field when BUSSECCFG.VALID is set may result in undefined
// behavior.
#define PRCM_CPULOCK_LOCKNSMPU                                      0x00000002
#define PRCM_CPULOCK_LOCKNSMPU_BITN                                          1
#define PRCM_CPULOCK_LOCKNSMPU_M                                    0x00000002
#define PRCM_CPULOCK_LOCKNSMPU_S                                             1

// Field:     [0] LOCKSMPU
//
// When set will lock secure MPU
//
// Writing this field when BUSSECCFG.VALID is set may result in undefined
// behavior.
#define PRCM_CPULOCK_LOCKSMPU                                       0x00000001
#define PRCM_CPULOCK_LOCKSMPU_BITN                                           0
#define PRCM_CPULOCK_LOCKSMPU_M                                     0x00000001
#define PRCM_CPULOCK_LOCKSMPU_S                                              0


#endif // __PRCM__
